tests/Rendimiento/statistics.json
{
  "HTTP Request GET: LandingPage" : {
    "transaction" : "HTTP Request GET: LandingPage",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 417.85333333333347,
    "medianResTime" : 424.5,
    "minResTime" : 7.0,
    "maxResTime" : 823.0,
    "pct1ResTime" : 643.8000000000001,
    "pct2ResTime" : 684.75,
    "pct3ResTime" : 822.96,
    "throughput" : 172.61219792865361,
    "receivedKBytesPerSec" : 160.47540276179518,
    "sentKBytesPerSec" : 19.722292146144994
  },
  "HTTP Request GET: ManageBooks" : {
    "transaction" : "HTTP Request GET: ManageBooks",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 454.6666666666666,
    "medianResTime" : 511.5,
    "minResTime" : 128.0,
    "maxResTime" : 664.0,
    "pct1ResTime" : 629.0,
    "pct2ResTime" : 633.95,
    "pct3ResTime" : 638.99,
    "throughput" : 72.67441860465117,
    "receivedKBytesPerSec" : 67.56449854651163,
    "sentKBytesPerSec" : 9.084302325581396
  },
  "HTTP Request GET: Biblioteca" : {
    "transaction" : "HTTP Request GET: Biblioteca",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 580.6200000000002,
    "medianResTime" : 593.0,
    "minResTime" : 156.0,
    "maxResTime" : 677.0,
    "pct1ResTime" : 649.0,
    "pct2ResTime" : 651.0,
    "pct3ResTime" : 663.0,
    "throughput" : 76.00709399543958,
    "receivedKBytesPerSec" : 70.66284519888522,
    "sentKBytesPerSec" : 9.426661071700025
  },
  "HTTP Request GET: manageUsers" : {
    "transaction" : "HTTP Request GET: manageUsers",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 592.2933333333333,
    "medianResTime" : 588.5,
    "minResTime" : 292.0,
    "maxResTime" : 663.0,
    "pct1ResTime" : 639.0,
    "pct2ResTime" : 645.95,
    "pct3ResTime" : 659.94,
    "throughput" : 68.64988558352402,
    "receivedKBytesPerSec" : 63.82294050343249,
    "sentKBytesPerSec" : 8.581235697940503
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 525.2945833333335,
    "medianResTime" : 569.0,
    "minResTime" : 7.0,
    "maxResTime" : 823.0,
    "pct1ResTime" : 639.0,
    "pct2ResTime" : 651.0,
    "pct3ResTime" : 676.0,
    "throughput" : 460.5641911341393,
    "receivedKBytesPerSec" : 428.1807714450201,
    "sentKBytesPerSec" : 55.77144502014968
  },
  "HTTP Request GET: pageHome" : {
    "transaction" : "HTTP Request GET: pageHome",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 496.90999999999997,
    "medianResTime" : 538.0,
    "minResTime" : 10.0,
    "maxResTime" : 671.0,
    "pct1ResTime" : 659.9000000000001,
    "pct2ResTime" : 665.0,
    "pct3ResTime" : 669.99,
    "throughput" : 129.42191544434857,
    "receivedKBytesPerSec" : 120.32193701466781,
    "sentKBytesPerSec" : 15.29301930543572
  },
  "HTTP Request GET: Forum" : {
    "transaction" : "HTTP Request GET: Forum",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 566.5866666666659,
    "medianResTime" : 570.0,
    "minResTime" : 413.0,
    "maxResTime" : 662.0,
    "pct1ResTime" : 632.0,
    "pct2ResTime" : 635.0,
    "pct3ResTime" : 638.0,
    "throughput" : 66.5335994677312,
    "receivedKBytesPerSec" : 61.85545575515635,
    "sentKBytesPerSec" : 7.926854624085163
  },
  "HTTP Request GET: Register" : {
    "transaction" : "HTTP Request GET: Register",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 545.1300000000003,
    "medianResTime" : 560.0,
    "minResTime" : 73.0,
    "maxResTime" : 680.0,
    "pct1ResTime" : 625.0,
    "pct2ResTime" : 639.95,
    "pct3ResTime" : 676.0,
    "throughput" : 87.54012255617158,
    "receivedKBytesPerSec" : 81.38495768894076,
    "sentKBytesPerSec" : 10.857026918587685
  },
  "HTTP Request GET: Login" : {
    "transaction" : "HTTP Request GET: Login",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 548.2966666666671,
    "medianResTime" : 577.0,
    "minResTime" : 31.0,
    "maxResTime" : 689.0,
    "pct1ResTime" : 644.0,
    "pct2ResTime" : 660.0,
    "pct3ResTime" : 673.0,
    "throughput" : 105.48523206751055,
    "receivedKBytesPerSec" : 98.06830168776372,
    "sentKBytesPerSec" : 12.56757647679325
  }
}